In [34]:
import sqlite3
import csv
import pandas as pd
import traceback
import sys
from sqlalchemy import create_engine

In [21]:
db = "test3.db"

## Creacion de Tablas

In [22]:
## CREACION DE TABLAS

con = sqlite3.connect(db)
cur = con.cursor()


try:
    sql_file = open("createTables.sql")
    sql_as_string = sql_file.read()
    cur.executescript(sql_as_string)
except sqlite3.Error as er:
     print('SQLite error: %s' % (' '.join(er.args)))
     print("Exception class is: ", er.__class__)
     print('SQLite traceback: ')
     exc_type, exc_value, exc_tb = sys.exc_info()
     print(traceback.format_exception(exc_type, exc_value, exc_tb))
     con.close()

con.close()

## Migrar datos desde archivos CSV

### Leer los CVS

In [23]:
depts = pd.read_csv('data/departments.csv', header=0)
emps = pd.read_csv('data/hired_employees.csv')
jobs = pd.read_csv('data/jobs.csv')

### Generar Dataframes

In [24]:
depts = pd.read_csv('data/departments.csv', header=None)
depts.columns = ['id', 'department']

jobs = pd.read_csv('data/jobs.csv', header=None)
jobs.columns = ['id', 'job']

hired_employees = pd.read_csv('data/hired_employees.csv', header=None)
hired_employees.columns = ['id', 'name', 'department_id', 'job_id', 'datetime']

### Llenar las tablas a partir de los DataFrames

In [26]:
con = sqlite3.connect(db)

try:
    depts.to_sql('departments', con, if_exists='append', index=False)
except sqlite3.Error as er:
     print('SQLite error: %s' % (' '.join(er.args)))
     print("Exception class is: ", er.__class__)
     print('SQLite traceback: ')
     exc_type, exc_value, exc_tb = sys.exc_info()
     print(traceback.format_exception(exc_type, exc_value, exc_tb))
     
try:
    jobs.to_sql('jobs', con, if_exists='append', index=False)
except sqlite3.Error as er:
     print('SQLite error: %s' % (' '.join(er.args)))
     print("Exception class is: ", er.__class__)
     print('SQLite traceback: ')
     exc_type, exc_value, exc_tb = sys.exc_info()
     print(traceback.format_exception(exc_type, exc_value, exc_tb))
     
try:
    hired_employees.to_sql('hired_employees', con, if_exists='append', index=False)
except sqlite3.Error as er:
     print('SQLite error: %s' % (' '.join(er.args)))
     print("Exception class is: ", er.__class__)
     print('SQLite traceback: ')
     exc_type, exc_value, exc_tb = sys.exc_info()
     print(traceback.format_exception(exc_type, exc_value, exc_tb))
     
con.close()

In [48]:
# SQLAlchemy connectable
cnx = create_engine('sqlite:///' + db).connect()
# table named 'contacts' will be returned as a dataframe.
jobsDf = pd.read_sql_table('JOBS', cnx)
deptsDf = pd.read_sql_table('DEPARTMENTS', cnx)
empsDf = pd.read_sql_table('HIRED_EMPLOYEES', cnx)

TypeError: fromisoformat: argument must be str

In [51]:
con = sqlite3.connect(db)

sql_query = pd.read_sql('SELECT * FROM DEPARTMENTS', con)
depts = pd.DataFrame(sql_query)
sql_query = pd.read_sql('SELECT * FROM JOBS', con)
jobs = pd.DataFrame(sql_query)
sql_query = pd.read_sql('SELECT * FROM HIRED_EMPLOYEES', con)
hired_employees = pd.DataFrame(sql_query)

con.close()

In [55]:
depts

    id                department
0    1        Product Management
1    2                     Sales
2    3  Research and Development
3    4      Business Development
4    5               Engineering
5    6           Human Resources
6    7                  Services
7    8                   Support
8    9                 Marketing
9   10                  Training
10  11                     Legal
11  12                Accounting

In [106]:
hired_employees[hired_employees['name'].isna()]

        id name         department_id  job_id  datetime
161    162  NaN  2021-04-22T14:31:39Z     4.0      91.0
339    340  NaN  2022-01-13T21:09:49Z     4.0      45.0
349    350  NaN  2021-07-13T23:34:40Z    10.0      86.0
570    571  NaN  2021-11-28T02:28:40Z     7.0      69.0
622    623  NaN  2022-01-04T17:42:48Z     7.0      48.0
765    766  NaN  2021-05-31T05:31:53Z     2.0      67.0
772    773  NaN  2021-11-16T02:34:50Z     5.0      35.0
830    831  NaN  2021-10-22T16:30:46Z     6.0      11.0
936    937  NaN  2021-03-26T20:41:40Z     3.0      60.0
969    970  NaN  2021-08-08T06:06:40Z     4.0      33.0
1048  1049  NaN  2021-05-08T23:05:13Z     6.0      91.0
1129  1130  NaN  2021-10-19T08:43:38Z     1.0     128.0
1169  1170  NaN  2021-03-15T10:47:48Z     7.0     130.0
1194  1195  NaN  2021-08-13T09:22:18Z    10.0      54.0
1321  1322  NaN  2021-03-26T23:44:34Z     5.0      47.0
1492  1493  NaN  2021-03-20T10:48:47Z    10.0     153.0
1687  1688  NaN  2022-01-20T19:51:12Z    11.0     100.0
1798  1799  NaN  2021-03-10T07:35:09Z     8.0     111.0
1857  1858  NaN  2021-06-28T03:01:01Z     6.0     144.0

In [12]:
res = cur.execute("SELECT name FROM sqlite_master WHERE name='spam'")
res.fetchone() is None

ProgrammingError: Cannot operate on a closed database.

In [12]:
cur.execute("""
    INSERT INTO movie VALUES
        ('Monty Python and the Holy Grail', 1975, 8.2),
        ('And Now for Something Completely Different', 1971, 7.5)
""")

In [16]:
data = [
    ("Monty Python Live at the Hollywood Bowl", 1982, 7.9),
    ("Monty Python's The Meaning of Life", 1983, 7.5),
    ("Monty Python's Life of Brian", 1979, 8.0),
]
cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data)
con.commit()  # Remember to commit the transaction after executing INSERT.

In [13]:
con.commit()

In [17]:
res = cur.execute("SELECT * FROM movie")
res.fetchall()

[('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0)]

In [18]:
for row in cur.execute("SELECT year, title FROM movie ORDER BY year"):
    print(row)

(1971, 'And Now for Something Completely Different')
(1975, 'Monty Python and the Holy Grail')
(1979, "Monty Python's Life of Brian")
(1982, 'Monty Python Live at the Hollywood Bowl')
(1983, "Monty Python's The Meaning of Life")

In [20]:
con.close()
new_con = sqlite3.connect("tutorial.db")
new_cur = new_con.cursor()
res = new_cur.execute("SELECT title, year FROM movie ORDER BY score DESC")
title, year = res.fetchone()
print(f'The highest scoring Monty Python movie is {title!r}, released in {year}')

The highest scoring Monty Python movie is 'Monty Python and the Holy Grail', released in 1975